# 核心池：宽基 + 核心资产 (原版4只)
CORE_POOL = {
    "518880": "黄金ETF",
    "513100": "纳指ETF",
    "159915": "创业板ETF",
    "511090": "30年国债ETF",
    #"588000": "科创50ETF"
}

# 全量池：包含细分行业、跨境、商品等
FULL_POOL = {
    # --- 境外 ---
    "513100": "纳指ETF",
    "159509": "纳指科技ETF",
    "513520": "日经ETF",
    "513030": "德国ETF",
    
    # --- 商品 ---
    "518880": "黄金ETF",
    "159980": "有色ETF",
    "159985": "豆粕ETF",
    "159981": "能源化工ETF",
    "501018": "南方原油",

    # --- 债券 ---
    "511090": "30年国债ETF",

    # --- 国内/港股 ---
    "513130": "恒生科技",
    "513690": "港股红利",
    "510180": "上证180",
    "159915": "创业板ETF",
    
    # --- 行业/主题 ---
    "510410": "资源ETF",
    "515650": "消费50",
    "512290": "生物医药",
    "588120": "科创100",
    "515070": "人工智能ETF",
    "159851": "金融科技",
    "159637": "新能源车",
    "516160": "新能源",
    "159550": "互联网ETF",
    "512710": "军工龙头",
    "159692": "证券ETF",
    "512480": "半导体",
    "515250": "智能汽车",
    "159378": "通用航空",
    "516510": "云计算",
    "515050": "5G通信",
    "159995": "芯片",
    "515790": "光伏",
    "515000": "科技50"
}

# 自定义池：可以自由添加想要测试的ETF
# 使用方法：在此字典中添加 {代码: 名称} 的键值对
CUSTOM_POOL = {
    # 示例：可以添加任意ETF进行测试
    # "518880": "黄金ETF",
    # "510410": "资源ETF",
    # "513100": "纳指ETF",
    "512480": "半导体",
    "159995": "芯片"


}

# 池子映射字典
POOL_DICT = {
    "core": CORE_POOL,
    "full": FULL_POOL,
    "custom": CUSTOM_POOL  # 自定义池
}
